<template>
<div>
    <Header v-bind:courseData="courseData" />
    <Features v-bind:courseData="courseData" />
    <Program v-bind:courseData="courseData" />
    <Tools v-bind:courseData="courseData" />
    <Prices v-bind:courseData="courseData" />
    <Speaker v-bind:speakerData="speakerData" />
</div>
</template>

<script>
import Features from '../components/Course/Features.vue'
import Header from '../components/Course/Header.vue'
import Prices from '../components/Course/Prices.vue'
import Program from '../components/Course/Program.vue'
import Speaker from '../components/Course/Speaker.vue'
import Tools from '../components/Course/Tools.vue'
export default {
    components: { Header, Features, Program, Tools, Prices, Speaker },
    data() {
        return {
            speakerData: {
                img: '/img/teachers/2.png',
                name: 'Мария',
                description: 'Я Мария, ваш наставник и проводник в страну живописи!<br><br> Хочу вам показать  огромный  мир  цветной и яркий, <br>О самом главном,  интересном рассказать, <br>Мы мир раскрасим красочной палитрой <br>Научимся  его любить и понимать!',
                univer: [
                    'Художественное отделение МБОУ ДОД города Кургана «Детская  школа  искусств им.  В. А. Громова», свидетельство об окончании с отличием',
                    'МБОУДО города Кургана «ДХШ им. В. Ф. Илюшина» свидетельство об окончании с отличием ',
                    'Студентка Тюменского государственного института культуры, факультет: «Дизайн». '

                ],
                quotes: [
                    'В каждой  краске найдётся цветов понемногу,<br> Каждая  нам    раскрасит  дорогу,<br>Небо и звёзды, и солнечный свет – <br>Наш  разноцветный скуке ответ!',

                    'Наберу на кисть поярче краски - <br>Желтой, розовой, зеленой, голубой… <br>И таким прекрасным, словно в сказке,<br>Разноцветный мир хочу я видеть свой!'
                ],
                achiv: [
                    'Премия «Юные таланты Кургана» за творческие достижения   от руководителя Администрации города Кургана.',
                    'Диплом Администрации города Кургана за 1 место в городском конкурсе в сфере экологической безопасности и охраны окружающей среды ',
                    'Диплом лауреата I областной научно - практической конференции« Я– исследователь» в рамках областного педагогического Арт - форума« Культура и образование в современном обществе», посвященном Году культуры в России.',
                    'Диплом лауреата III степени II областной научно - практической конференции« Я– исследователь».',
                    'Грамоты ФГБОУДО ВДЦ« Смена», ФГБОУ« МДЦ« Артек», ФГБОУ ВДЦ« Океан» за творческие успехи в период реализации тематических смен.',
                    'Участие в проекте Курганского областного интернет - портала« Очевидец Медиа» на присуждение региональной общественной премии« Персона года 2014», номинация« Искусство.Творчество.Живопись» 2014 г.', 'Дипломы победителя и лауреата международных и всероссийских конкурсов декоративно - прикладного искусства '

                ],
                style: 'cs-1'
            },
            courseData: {
                tarifs: [{
                        name: 'Доступ на 3 месяца',
                        price: '3000 рублей',
                        pricePerM: '(1000 рублей/ месяц)',

                    },
                    {
                        name: 'Доступ на 6 месяцев',
                        price: '4200 рублей',
                        pricePerM: '(700 рублей/ месяц)',

                    },
                    {
                        name: 'Доступ на 1 год',
                        price: '6000 рублей',
                        pricePerM: '(500 рублей/ месяц)',

                    },
                ],
                priceDescription: 'Проанализируйте свое свободное время и подумайте, как часто вы сможете заниматься рисованием? ',
                priceSecondDescription: [
                    'Если у вас достаточно свободного времени и вы можете много заниматься, вам подойдет тариф на 3 месяца',
                    'Если у вас мало времени и у вас нет возможности часто заниматься, то мы предлагаем взять вам тариф на 6 или 12 месяцев'
                ],
                header: 'курс 1',
                description: 'Онлайн-курс по рисованию «ChilDo»для детей — это увлекательное путешествие в мир ярких красок, креатива и творчества.',
                girl: 'tanya',
                style: 'cs-1',
                tools: [
                    'Набор акриловых красок', 'Белая краска (белила титановые) — стоит приобрести отдельно, так как она используется в каждом рисунке', 'Палитра', 'Карандаш простой', 'Точилка', 'Ластик', 'Набор бумаги для рисования (для акрила, гуаши) плотность от 150 гр/м2, размер 30х40 см или холст на картоне 30х40 см', 'Тонированная бумага (черная)', 'Кисть синтетика круглая №2, №5, №10', 'Кисть синтетика плоская №5, №18', 'Кисть щетина №10', 'Ватные палочки', 'Губка поролоновая бытовая', 'Черный фломастер или тонкий маркер', 'Воздушный шарик', 'Сухие и влажные салфетки', 'Лист плотного картона'

                ],
                apple: [
                    'Планшет iPad Pro (рекомендовано) или iPad с поддержкой Apple Pencil',

                    ' Стилуc Apple Pencil — подробнее о совместимости планшета и стилуса >>>',

                    'Программа Procreate для iPad (примерная цена 900 рублей) <br>На занятиях мы будем использовать эти устройства и программное обеспечение, но вы можете подобрать аналогичные варианты других производителей.'
                ],
                progs: [
                    'Adobe Photoshop Sketch',
                    'Adobe Illustrator Draw',
                    'MediBang Paint',
                    'Autodesk SketchBook',
                    'ArtFlow'

                ],
                bonuses: [{
                        name: 'Чек лист основы Procreate- ',
                        link: ''
                    },
                    {
                        name: 'Каталог кистей для программы Procreate- ',
                        link: ''
                    }
                ],
                toolsimage: '/courses/2/tools/tools.jpg',
                features: [{
                        name: 'Курс состоит 13 уроков',
                        description: 'Их сложность повышается постепенно, поэтому приступать к занятиям можно «с нуля», без навыков рисования. С каждым новым уроком, будто поднимаясь по творческим ступенькам, ребенок будет узнавать все больше информации о различных изобразительных техниках и в итоге научится применять их в любой работе.',
                        img: '/1/features/1.png',

                    },
                    {
                        name: 'Весь материал подается очень просто',
                        description: 'Юные художники узнают, как правильно расположить предмет на формате, что такое художественное пространство картины и для чего нужна линия горизонта. Педагог расскажет, как нужно смешивать краски и познакомит детей с понятиями света, тени, фактуры, градиента и цветовой гаммы. ',
                        img: '/1/features/2.png',

                    },
                    {
                        name: 'Дополнительные позновательные рассказы',
                        description: 'А еще в каждом уроке есть небольшой рассказ об изображаемом животном, предмете или явлении. Любознательным деткам точно будет интересно узнать о жизни диких животных и птиц, о космосе и природе.',
                        img: '/1/features/3.png',

                    },
                    {
                        name: 'Домашние задания после уроков',
                        description: 'В конце каждого урока юных художников будет ждать домашнее задание: сфотографировать получившийся рисунок и отправить его на проверку. После этого откроется доступ к следующему занятию.',
                        img: '/1/features/4.png',

                    },
                    {
                        name: 'Необычные материалы',
                        description: 'В работе над картинами ребята смогут использовать как традиционные кисти, так и необычные инструменты: воздушные шарики, поролоновые губки, ватные палочки и многое другое. Необычный подход помогает ребенку развить творческое мышление и фантазию. А главное, именно так дети учатся видеть красоту в самых обычных вещах. Похоже на настоящее волшебство, правда?',
                        img: '/1/features/5.png',

                    },
                ],

                lessons: [{
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'orange'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'green'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'pink'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'blue'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'pink'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'orange'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'orange'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'green'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'blue'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'blue'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'pink'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'orange'
                    },
                    {
                        img: '/courses/1/prog/prog1.png',
                        smallDescription: 'Узнаем, что такое художественное пространство картины и нарисуем забавного пингвина.',
                        name: 'УРОК 1 “ПРИВЕТ ИЗ АНТАРКТИКИ”',
                        color: 'green'
                    },
                ]
            },
        }
    },
}
</script>

<style>

</style>
