<template>
<footer>
    <div class="container">
        <div class="links">
            <div class="logo"></div>
            <div class="link">

                ИП Кармацких Е.С. <br><br>
                ИНН 8602300240494</div>
            <div class="link">
                <div @click="dialog=true">Пользовательское соглашение</div>
                <div @click="sogle=true">Политика конфиденциальности</div>
                <br><br>
                <div>Инстаграм @instagram</div>
                <div>E-mail name@domain.zone</div>
            </div>
        </div>
        <div class="jiraf"></div>
    </div>

    <el-dialog title="Согласие на обработку" :visible.sync="sogle">
        <p>Предоставляя свои персональные данные Покупатель даёт согласие на обработку, хранение и использование своих персональных данных на основании ФЗ № 152-ФЗ «О персональных данных» от 27.07.2006 г. в следующих целях:</p>
        <p>Регистрации Пользователя на сайте<br>Осуществление клиентской поддержки<br>Получения Пользователем информации о маркетинговых событиях<br>Выполнение Продавцом обязательств перед Покупателем<br>Проведения аудита и прочих внутренних исследований с целью повышения качества предоставляемых услуг.<br>Под персональными данными подразумевается любая информация личного характера, позволяющая установить личность Покупателя такая как:</p>
        <p>Фамилия, Имя, Отчество<br>Дата рождения<br>Контактный телефон<br>Адрес электронной почты<br>Почтовый адрес<br>Персональные данные Покупателей хранятся исключительно на электронных носителях и обрабатываются с использованием автоматизированных систем, за исключением случаев, когда неавтоматизированная обработка персональных данных необходима в связи с исполнением требований законодательства.</p>
        <p>Продавец обязуется не передавать полученные персональные данные третьим лицам, за исключением следующих случаев:</p>
        <p>По запросам уполномоченных органов государственной власти РФ только по основаниям и в порядке, установленным законодательством РФ<br>Стратегическим партнерам, которые работают с Продавцом для предоставления продуктов и услуг, или тем из них, которые помогают Продавцу реализовывать продукты и услуги потребителям. Мы предоставляем третьим лицам минимальный объем персональных данных, необходимый только для оказания требуемой услуги или проведения необходимой транзакции.<br>Продавец оставляет за собой право вносить изменения в одностороннем порядке в настоящие правила, при условии, что изменения не противоречат действующему законодательству РФ. Изменения условий настоящих правил вступают в силу после их публикации на Сайте.</p>
    </el-dialog>
    <el-dialog :visible.sync="dialog" title="Пользовательское соглашение">
        <p class="sogl" v-html="sogl"></p>
    </el-dialog>
</footer>
</template>

<script>
export default {
    data() {
        return {
            dialog: false,
            sogle: false,
            sogl: "Индивидуальный предприниматель Кармацких Екатерина Сергеевна (ИП Кармацких Е.С.), именуемый в дальнейшем «Оператор Портала», настоящим предлагает любому физическому лицу, достигшему возраста, допустимого в соответствии с законодательством Российской Федерации для акцепта настоящего предложения и обладающему соответствующими полномочиями, заключить Пользовательское соглашение на условиях, указанных ниже.</p><p>1. Термины и определения<br>«Онлайн-курс» – массовый открытый онлайн курс, разработанный Правообладателями и размещенный на Портале, реализуемый с применением электронного обучения и дистанционных образовательных технологий.</p><p>«Услуги» – доведение онлайн-курсов по сети Интернет до Пользователя путем предоставления Пользователю доступа к онлайн-курсам и обеспечения Просмотра выбранного им онлайн-курса на Портале, а также предоставление иных сервисов, доступных на Портале.</p><p>«Портал» – принадлежащий Оператору Портала портал (Интернет-сайт) онлайн-обучения по адресу openprofession.ru, предназначенный для размещения массовых открытых онлайн-курсов.</p><p>«Оператор Портала» – Индивидуальный предприниматель Кармацких Екатерина Сергеевна управляющая Порталом и оказывающая Услуги Пользователям, ЕГРИП 321723200007192, ИНН 860230240494 адрес: 625009, Тюменская обл, Тюмень г, Товарное шоссе ул, 15, контактный e-mail: info@childo-art.ru. Обращения, предложения и претензии Пользователей к Оператору Портала в связи с настоящим Пользовательским соглашением и всеми вопросами по функционированию Портала, нарушениями прав и интересов третьих лиц при его использовании могут быть направлены на указанный e-mail адрес Оператора Портала.</p><p>«Пользователь» – любое физическое лицо, принявшее настоящее предложение, зарегистрированное на Портале, получившее доступ к Порталу посредством сети Интернет, достигшее возраста, допустимого в соответствии с законодательством Российской Федерации для акцепта настоящей публичной оферты, и обладающее соответствующими полномочиями.</p><p>«Регистрация» – действия Пользователя по заполнению и отправке регистрационной формы, размещенной на Портале, которые, в случае отсутствия у Оператора Портала возражений по регистрации Пользователя, влекут за собой создание учетной записи Пользователя с присвоением логина и пароля для доступа к Порталу.</p><p>«Авторизация» – введение Пользователем своего логина и пароля для входа в свою учетную запись на Портале.</p><p>«Правообладатель» – общеобразовательная организация, профессиональная образовательная организация, образовательная организация высшего образования, организация дополнительного образования или организация дополнительного профессионального образования, обладающая исключительным правом на онлайн-курсы и заключившая с Оператором Портала лицензионный или агентский договор о предоставлении Оператору Портала права использования онлайн-курсов теми способами и в том объеме, которые необходимы и достаточны для оказания Услуг Пользователям.</p><p>«Просмотр» – реализованный Пользователем доступ к онлайн-курсам в сети Интернет, в течение которого Пользователь может смотреть (слушать) онлайн-курс из любого места и в любое время по своему выбору посредством соответствующих технических устройств.</p><p>2. Общие положения<br>2.1. В соответствии со статьей 437 Гражданского кодекса Российской Федерации, настоящее Пользовательское соглашение является официальным, публичным и безотзывным предложением (публичной офертой) Оператора Портала, адресованным Пользователям, заключить договор на указанных ниже условиях.</p><p>Пользователь обязан полностью ознакомиться с настоящей публичной офертой до момента регистрации на Портале.</p><p>2.2. Полным и безоговорочным акцептом настоящей публичной оферты является совершение Пользователем действий, выражающихся в последовательном выполнении всех регистрационных процедур и активации учетной записи Пользователя.</p><p>2.3. Акцепт оферты означает, что Пользователь согласен со всеми положениями настоящей публичной оферты и обязуется им следовать. С момента акцепта Пользователем настоящего предложения данное предложение считается Пользовательским соглашением, заключенным между Оператором Портала и Пользователем на условиях, установленных в настоящем предложении.</p><p>2.4. В отношении функционирования и развития Портала Оператор Портала руководствуется законодательством Российской Федерации, настоящим Пользовательским соглашением и иными специальными документами, которые разработаны или могут быть разработаны и приняты Оператором Портала в целях регламентации предоставления Пользователям доступа к функционалу Порталу.</p><p>3. Предмет соглашения и порядок оказания Услуг<br>3.1. Оператор Портала обязуется на условиях, установленных настоящим Пользовательским соглашением, предоставлять Пользователю доступ к онлайн-курсам для бесплатного Просмотра, а Пользователь обязуется надлежащим образом выполнять условия, установленные настоящим Соглашением.</p><p>3.2. Для получения Пользователем доступа к онлайн-курсам требуется регистрация Пользователя на Портале.</p><p>3.3. Стоимость услуг по настоящему Пользовательскому соглашению составляет 1 рубль, в том числе НДС 18%. Услуги оказываются Пользователю безвозмездно.</p><p>4. Регистрация Пользователя<br>4.1. Для регистрации Пользователя на Портале Пользователь обязуется предоставить Оператору Портала регистрационную форму (анкету), заполнив её достоверной, полной и точной информацией о себе, и поддерживать ее в актуальном виде.</p><p>4.2. Пользователь соглашается с тем, что действия, совершенные на Портале после Авторизации Пользователя (по его логину и паролю), признаются действиями Пользователя.</p><p>4.3. Регистрируясь на Портале, Пользователь дает согласие на получение информационных сообщений на указанный при регистрации адрес электронной почты.</p><p>4.4. При регистрации на Портале Пользователь обязан предоставить Оператору Портала необходимую достоверную и актуальную информацию для формирования учетной записи Пользователя, включая уникальные для каждого Пользователя логин и пароль доступа к Порталу, а также фамилию и имя. Регистрационная форма Портала может запрашивать у Пользователя дополнительную информацию.</p><p>4.5. Пользователь несет ответственность за достоверность, актуальность, полноту и соответствие законодательству Российской Федерации предоставленной при регистрации информации и ее чистоту от претензий третьих лиц.</p><p>4.6. После предоставления информации, Пользователю необходимо пройти ряд удостоверительных процедур, а именно:</p><p>подтвердить свою регистрацию путем активации учетной записи через сообщение, отправленное Оператором Портала на электронную почту Пользователя.<br>Оператор Портала может использовать дополнительные процедуры, включая:</p><p>предложение Пользователю подтвердить регистрацию путем распознания автоматизированного теста, предназначенного для различия компьютеров и людей («капча»);<br>отправку кода регистрации посредством sms-сообщения на мобильный телефон Пользователя, номер которого предоставляется самим Пользователем.<br>В случае верного последовательного выполнения всех регистрационных действий на Сайте создается учетная запись Пользователя.</p><p>4.7. Пользователь на используемом им аппаратно-программном обеспечении может разрешить хранение логина и пароля (с использованием файлов cookies или аналогичных технологий) для последующей автоматической авторизации на Портале.</p><p>4.8. Пользователь несет ответственность за безопасность логина и пароля, а также за все действия, совершенные Пользователем после Авторизации. Пользователь обязан немедленно уведомить Оператора Портала о любом случае неавторизированного доступа с его логином и паролем и/или о любом нарушении безопасности. Оператор Портала не несет ответственности за ущерб, причиненный в результате несанкционированного доступа к учетной записи Пользователя.</p><p>4.9. В случае передачи Пользователем логина и пароля какому-либо третьему лицу, всю ответственность за действия этого третьего лица, совершенные на Портале, несет Пользователь.</p><p>5. Условия использования онлайн-курсов<br>5.1. Онлайн-курсы доступны Пользователю для Просмотра на Портале в целях их освоения без дальнейшего оценивания результатов освоения и без получения документов, свидетельствующих об освоении курсов.</p><p>5.2. Пользователь не должен нарушать, блокировать или иным образом наносить ущерб каким-либо средствам безопасности Портала, а также средствам, предотвращающим или ограничивающим использование или копирование какого-либо онлайн-курса.</p><p>5.3. Пользователь вправе использовать онлайн-курсы исключительно путем частного Просмотра и не вправе использовать онлайн-курсы (частично или полностью) иным способом, в частности в коммерческих или иных целях, за исключением указанных в пункте 5.1 настоящего Пользовательского соглашения.</p><p>Какое-либо иное использование онлайн-курсов является нарушением настоящего Пользовательского соглашения, охраняемых законом интеллектуальных прав Правообладателей, и может повлечь привлечение к ответственности в соответствии с законодательством Российской Федерации.</p><p>6. Права и обязанности Сторон<br>6.1. Оператор Портала вправе:</p><p>6.1.1. по своему собственному усмотрению приостанавливать, ограничивать или прекращать доступ Пользователя ко всем или к любому из разделов или сервисов Портала;</p><p>6.1.2. устанавливать любые ограничения в использовании Портала, в любое время изменять настоящее Пользовательское соглашение в одностороннем порядке, опубликовав на Портале новую редакцию настоящей публичной оферты Оператора Портала, без получения согласия Пользователя.</p><p>6.2. Оператор Портала обязан:</p><p>6.2.1. предпринимать все зависящие от него действия для обеспечения бесперебойной работы Портала, однако он не несет ответственности за перерывы в его работе (в т.ч. аварийные, профилактические), за недостаточное качество или скорость предоставления данных, за полную или частичную утрату каких-либо данных, размещенных на Портале, или за причинение любых других убытков, которые возникли или могут возникнуть при пользовании Порталом.</p><p>6.3. Пользователь обязан:</p><p>6.3.1. не вводить Оператора Портала и/или других Пользователей в заблуждение относительно своей личности;</p><p>6.3.2. не осуществлять действий, направленных на получение доступа к чужой учетной записи, путем подбора логина и пароля, взлома или иных действий.</p><p>6.3.3. самостоятельно следить за изменениями условий настоящего Пользовательского соглашения на Портале.</p><p>7. Ответственность<br>7.1. Оператор Портала не несет ответственности за любые убытки, произошедшие из-за использования онлайн-курсов либо невозможности доступа к онлайн-курсам, несанкционированного доступа к коммуникациям Пользователя, заявления или поведения любого третьего лица на Портале.</p><p>7.2. Пользователь и Оператор Портала соглашаются, что все споры и разногласия, которые могут возникнуть из настоящего Пользовательского соглашения или в связи с ним, будут разрешаться путем переговоров. Если согласие не будет достигнуто, все споры по поводу настоящего Пользовательского соглашения разрешаются согласно нормам российского права.</p><p>7.3. Признание судом какого-либо положения настоящего Пользовательского соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности или неисполнимости иных положений Договора.</p><p>7.4. Бездействие со стороны Оператора Портала в случае нарушения Пользователем каких-либо положений настоящего Пользовательского соглашения не лишает Оператора Портала права предпринять соответствующие действия в защиту своих интересов позднее, а также не означает отказа Оператора Портала от своих прав в случае совершения в дальнейшем подобных либо сходных нарушений или нарушений других положений настоящего Пользовательского соглашения.</p><p>8. Персональные данные<br>8.1. Акцептуя настоящее предложение Пользовательского соглашения, Пользователь предоставляет свое согласие на обработку своих персональных данных, как без использования средств автоматизации, так и с их использованием.</p><p>8.2. Согласие дается на обработку следующих персональных данных Пользователя: фамилия, имя, отчество, адреса регистрации, постоянного проживания, дата и места рождения, сведения о навыках и квалификации (образовании, ученых степени и звании, опыте), адрес личной электронной почты.</p><p>8.3. Персональные данные не являются общедоступными.</p><p>8.4. Персональные данные Пользователя обрабатываются в целях предоставления доступа к онлайн-курсам для бесплатного просмотра и прослушивания онлайн-курсов.</p><p>8.5. Основанием для обработки персональных данных Пользователя являются ст. 24 Конституции Российской Федерации, ст.6 Федерального закона №152-ФЗ «О персональных данных» от 27 июля 2006 г.</p><p>8.6. В ходе обработки с персональными данными будут совершены следующие действия: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение.</p><p>8.7. Передача персональных данных третьим лицам осуществляется на основании законодательства Российской Федерации, договора с участием субъекта персональных данных или с согласия субъекта персональных данных. Пользователь не предоставляет согласие на возможную передачу своих персональных данных третьим лицам.</p><p>8.8. Персональные данные обрабатываются до прекращения деятельности ИП Кармацких Е.С..</p><p>8.9. Согласие дается, в том числе, на информационные (рекламные) оповещения.</p><p>8.10. Пользователь может прекратить обработку своих персональных данных ИП Кармацких Е.С. и удалить свой аккаунт на интернет-сайте childo-art.ru путем отзыва Пользователем или его законным представителем согласия на обработку персональных данных, путем направления письменного заявления (запроса) в ИП Кармацких Е.С. или ее представителю по адресу, указанному в начале Пользовательского Соглашения.</p><p>8.11. После получения соответствующего заявления (запроса) ИП Кармацких Е.С. в течение 30 дней прекращает обработку и хранение персональных данных Пользователя, удаляя его персональные данные.</p><p>8.12. В случае отзыва Пользователем или его законным представителем согласия на обработку персональных данных ИП Кармацких Е.С. вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в пунктах 2 – 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ «О персональных данных» от 26.06.2006 г.</p><p>8.13. Настоящее согласие действует все время до момента прекращения обработки персональных данных, указанных в п.8.8. и п.8.10. данного соглашения.</p><p>9. Заключительные положения<br>9.1. Правовые отношения, возникающие в связи с настоящим Пользовательским соглашением, регулируются законодательством Российской Федерации.</p><p>9.2. По вопросам, неурегулированным настоящим Пользовательским соглашением, Стороны руководствуются действующим законодательством Российской Федерации.<br></p>"
        }
    },
}
</script>

<style lang="scss" scoped>
.container {
    position: relative;
    display: flex;
    width: 100%;
    justify-content: space-between;
    align-items: center;
}

.link {
    flex: 1 1 300px;
    display: flex;
    flex-direction: column;

}

.links {
    display: flex;
    justify-content: space-between;
    flex: 1;
}

footer {
    overflow: hidden;
    position: relative;
}

footer::after {
    content: '';
    position: absolute;
    left: 0;
    bottom: -180px;
    height: 400px;
    width: 400px;
    background: url('../../public/img/angleGreen.svg') no-repeat left bottom / contain;
}

.jiraf {
    width: 300px;
    height: 400px;
    background: url('../../public/img/footerjiraf.png') no-repeat right center / contain;
}

.logo {
    display: none;
}

@media (max-width:1200px) {
    .container {
        padding: 0 40px;
    }
}

@media (max-width:900px) {

    .jiraf,
    footer::after {
        display: none;
    }

    footer {
        padding: 85px 0;
    }

    .logo {
        display: flex;
        height: 38px;
        width: 100px;
        background: url('../../public/img/logo.png') no-repeat left center / contain;
        margin-bottom: 50px;
    }

    .container {
        .links {
            flex-direction: column;

            .link {
                flex: unset;
                font-size: 18px;
                line-height: 22px;
                margin: 0;
            }

        }
    }
}
</style>
